app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("email", "password_hash", "password_salt", "created_at", "updated_at") VALUES ('nicolas@wearecloud.com', '$2a$10$zDR.nAx6FkCLl8j6CbGVGeI13SmWMcQ2oapZmkTymgQQiXXLxzCom', '$2a$10$zDR.nAx6FkCLl8j6CbGVGe', '2012-07-18 14:32:32.307105', '2012-07-18 14:32:32.307105')